/* 3.	Да се разработи програма, която изисква от потребителя да въведе две целочислени числа, x и y,
където x < y. Да се намерят и изведат всички прости числа завършващи на 3 в интервал [x,y].
*/

#include <stdio.h>

int main()
{
    int a, x, y;
    printf("Type the value of x and y\n");
    scanf(" %d", &x);
    scanf(" %d", &y);

    if(x < y){
        for(a = x; a <= y; a++){
            if(a%2 != 0 && a%5 != 0 && (a == 3 || a%10 == 3 || a%100 ==3)){
                printf(" %d", a);
            }
        }
    }



return 0;
}
