/*13. Да се разработи програма, която изисква от потребителя да въведе целочислено
число х, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери
сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в
масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише
като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички
интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в
интервала [0, 10). Масивът да се изведе на стандартния изход.*/

#include <iostream>
#include <math.h>
using namespace std;

int main()
{
    int x,n=0,p=0,i,z=-1,co=0;
    float sum,ar[10],y;
    do{
    cout<<"Enter X: ";
    cin>>x;
   }while(x<=0||x>=10);
  do{
      sum=0;
      z++;
			for(n=(z*x);n<(z+1)*x;n++)
                {
                y=cos(n);
				sum=sum+y;
			    }
            ar[co]=sum;
            co++;

  }while(co<10);
   for(co=0;co<10;co++)
     {
      cout<<ar[co]<<endl;
     }
}
