/*14. Да се разработи програма, която изисква от потребителя да въведе целочислено
число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери
първото число N в интервала [0; +∞) делящо се на х. Да се намери сумата на
всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се
намери второто число N' в интервала [0; +∞) делящо се на x. Да се намери сумата
на всички числа в интервала [0, N'] и да се запише като втори елемент в масива.
Аналогично да се запълнят и останалите елементи на масива. Масивът да се
изведе на стандартния изход.*/

#include <iostream>
using namespace std;
int main()
{
    int x,ar[10],co,sum,c,n;
    do{
    cout<<"Enter X: ";
    cin>>x;
   }while(x<0&&x<10);

    co=0;
	c=1;
	do{
		if (c%x==0)
         {
			sum=0;
			for(n=1;n<c;n++)
                {
				sum+=n;
			    }
			ar[co]=sum;
			co++;
		 }
		c++;
	}while (co<10);
	for(co=0;co<10;co++){
		cout<<ar[co]<<endl;
	}
}




