/*10. Да се разработи програма, която изисква от потребителя да въведе целочислено
число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят
първите 10 числа на Фибоначи в [0; +∞), които се делят на x без остатък.
Намерените стойности да се зададат като стойности на елементите в масива.
Елементите на масива да се изведат на стандартния изход.*/

#include <iostream>
using namespace std;

int main()
{
    int x,ar[1000],a[10],br=0,k;
   do{
    cout<<"Enter X: ";
    cin>>x;
   }while(x<=0||x>=10);
   ar[0]=1;
   ar[1]=1;
int i=1;

   do
   {
       i++;
        ar[i]=ar[i-1]+ar[i-2];
        if (ar[i]%x==0)
        {
             br++;
             for (k=br;k<=br;k++)
                 {
                     a[k]=ar[i];
                     cout<<a[k]<<endl;
                 }
        }
        if(br==10)break;
   }while(br<10);
}
