/*17. Да се разработи програма, която изисква от потребителя да въведе целочислено
число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери
първото число на Фибоначи в интервала [0; +∞) завършващо на x и да се запише
като първи елемент в масива. Да се намери второто число на Фибоначи в
интервала [0; +∞) завършващо на x и да се запише като втори елемент в масива.
Аналогично да се намерят първите N прости числа в интервала [0; +∞) и да се
запишат като елемент N в масива. Масивът да се изведе на стандартния изход.*/

#include <iostream>
using namespace std;

int main()
{
    int x,ar[1000],a[10],br=0,k;
   do{
    cout<<"Enter X: ";
    cin>>x;
   }while(x<=0||x>=10);
   ar[0]=1;
   ar[1]=1;
int i=1;
   do
   {
        i++;
        ar[i]=ar[i-1]+ar[i-2];
        if (ar[i]%10==x)
        {
             br++;
             for (k=br;k<=br;k++)
                 {
                     a[k]=ar[i];
                     cout<<a[k]<<endl;
                 }
        }
   }while(br<10);
}
