/*15. Да се разработи програма, която изисква от потребителя да въведе целочислено
число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери
сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като
първа стойност в масива. Да се намери сумата от всички числа в интервала
[0;1000) деляща се на 2x и да се запише като втора стойност в масива. Аналогично
да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да
се запишат като елемент N­1 в масива. Масивът да се изведе на стандартния изход.*/

#include <iostream>
using namespace std;
int main()
{
    int x, ar[10],i,br=-1,j,sm=0;
    do{
    cout<<"Enter X: ";
    cin>>x;
   }while(x<0&&x<10);


for (j=1;j<=10;j++)
{
    sm=0;
   for(i=1;i<1000;i++)
   {
       if(i%(j*x)==0)
        sm+=i;
   }

   br++;
   for (j=br;j<=br;j++)
   {
       ar[j]=sm;
       cout<<ar[j]<<endl;

   }
}
}
