/* 6.	Да се разработи програма, която изисква от потребителя да въведе целочислено число x,
където 0<x<10. Да се инициализира масив от 100 целочислени елемента. Стойностите на елементите
да са случайни числа в интервала [0, 100). Елементите на масива да се подредят така, че числата завършващи на x да са в началото. */

#include <stdio.h>
#include <time.h>

int main(){

    int arr [100],x,i,h,j;

    do{
        scanf(" %d", &x);
    }while(x>=10);

    srand(time(NULL));

    for(i=0; i<=99; i++){

        arr[i]= (rand()%100)+1;
    }
    for(j=0; j<=99; j++){
        for(i=0; i<=99-j-1; i++){
            if(arr[i]%10==x && arr[i-1]%10!=x){
                h= arr[i-1];
                arr[i-1]= arr[i];
                arr[i]= h;

            }
        }

    }

    for(i=0; i<=99; i++){
        printf("%d \n", arr[i]);
    }


return 0;
}
