/* 15.	Да се разработи програма, която изисква от потребителя да въведе целочислено число x,
където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в
 интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива. Да се намери
 сумата от всички числа в интервала [0;1000) деляща се на 2x и да се запише като втора стойност
 в масива. Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10]
 и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход. */

#include <stdio.h>


int main (){

    int arr[10], x, i, N, num= 0;

    do{
        scanf(" %d", &x);
    }while(x<0 && x>10);
    printf("\n\n");

    for(i=0; i<=9; i++){

        for(N=0; N<=1000;N++){

            if(N%((i+1)*x)==0){

                num+= N;
                arr[i]= num;

            }

        }
        printf("%d -> %d\n",i ,arr[i]);
    }




return 0;
}
