/* 5.	Да се разработи програма, която изисква от потребителя да въведе целочислено число, x,
 където 0 < x < 10. Да се инициализират масива от 10 елемента. Стойностите на елементите на масива
  да са равни на косинус от индекса на елемента. Да се изведе масивът, след което да се сортира в низходящ ред и отново да се изведе. */

#include <stdio.h>
#include <math.h>

int main(){

    int x,i,j;
    float arr [10], h;

    do{
        scanf(" %d", &x);
    }while(x>=10);

    for(i=0; i<=9; i++){
        arr[i]= cos(i);
        printf("%f\n", arr[i]);
    }

    for(j=0; j<=9; j++){
        for(i=0; i<=9-j-1; i++){
            if(arr[i]>arr[i+1]){
                h= arr[i];                // Алгоритъм за сортиране (optimazed)
                arr[i]= arr[i+1];
                arr[i+1]= h;
            }
        }

    }

    printf("SORTED\n\n");
    for(i=0; i<=9; i++){
    printf("%f\n", arr[i]);
    }

return 0;
}
